[M_Nast_Easter_Side01:DefeatSparkySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've been contacted by Sparky Flynt, son of the dearly departed Captain Flynt. He and the other members of his support group (Victims of Vault Hunters) intend to get revenge on you all.<br><br>Unfortunately, Sparky's other VOVH members have died due to extremely different and mysterious circumstances. Still, Sparky's fiery rage is unquenchable; he asked you to come find him so that he can kill you in person.<br><br>You found him! Now kill him."

[M_Nast_Easter_Side01:FindSparkySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've been contacted by Sparky Flynt, son of the dearly departed Captain Flynt. He and the other members of his support group (Victims of Vault Hunters) intend to get revenge on you all.<br><br>Unfortunately, Sparky's other VOVH members have died due to extremely different and mysterious circumstances. Still, Sparky's fiery rage is unquenchable; he's asked you to come find him so that he can kill you in person."

[M_Nast_Easter_Side01:FollowVarkid MissionObjectiveDefinition]
ProgressMessage="Follow varkid"

[M_Nast_Easter_Side01:InjectEggSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've been contacted by Sparky Flynt, son of the dearly departed Captain Flynt. He and the other members of his support group (Victims of Vault Hunters) intend to get revenge on you all.<br><br>Unfortunately, Sparky has lost track of the other VOVH members and, er, needs you to find them.  So they can kill you. He's very embarrassed about it.<br><br>First, you'll need to prime and follow a bloodhound varkid to the first assassin."

[M_Nast_Easter_Side01:IntroRevengeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've been contacted by Sparky Flynt, son of the dearly departed Captain Flynt. He and the other members of his support group (Victims of Vault Hunters) intend to get revenge on you all."

[M_Nast_Easter_Side01:ReturnToHammerlockSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've been contacted by Sparky Flynt, son of the dearly departed Captain Flynt. He and the other members of his support group (Victims of Vault Hunters) intended to get revenge on you all.<br><br>All the assassins were killed by bizarre accidents, however, and Sparky Flynt just fell by your hand. Sir Hammerlock has asked you to return to him -- he's got some information on why the hell all your would-be assassins died without your having to lay a finger on them."

[M_Nast_Easter_Side01:SearchForAssassinsSet0 MissionObjectiveSetDefinition]
MissionDescriptionOverride="You've been contacted by Sparky Flynt, son of the dearly departed Captain Flynt. He and the other members of his support group (Victims of Vault Hunters) intend to get revenge on you all.<br><br>Unfortunately, Sparky has lost track of the other VOVH members and, er, needs you to find them. So they can kill you. He's very embarrassed about it."
